{
  "backend/main.mo": "Motoko backend handling user profiles and network check result storage with access control and timestamped history retrieval.",
  "feature_evidence.json": "Feature evidence report mapping product features to associated frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Reference list providing short descriptive summaries for each frontend source file.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and theme-aware CSS for light and dark modes.",
  "frontend/index.html": "Root HTML document bootstrapping the frontend with a mount point and script entry.",
  "frontend/src/App.tsx": "Main React app shell containing theming, navigation tabs, header status display, footer, and integration of monitoring and auth components.",
  "frontend/src/features/auth/LoginButton.tsx": "Login/logout button component managing Internet Identity authentication with query cache clearing.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Dashboard UI displaying network status, metrics, and authentication prompts using cards and status indicators.",
  "frontend/src/features/diagnostics/DiagnosticsView.tsx": "Displays diagnostics UI with time‑window filtering, latency sparkline, and a table of recent connectivity checks.",
  "frontend/src/features/diagnostics/LatencySparkline.tsx": "Renders a simple SVG line chart visualizing latency values over time, including grid lines and status-based point markers.",
  "frontend/src/features/diagnostics/timeWindow.ts": "Defines time‑window types and filters timestamped items based on the selected duration.",
  "frontend/src/features/export/exportFormats.ts": "Converts connectivity measurements into CSV or JSON string formats for exporting.",
  "frontend/src/features/export/fileDownload.ts": "Creates a downloadable file from provided content using a temporary object URL and link element.",
  "frontend/src/features/export/ImportExportPanel.tsx": "Provides UI controls to export connectivity samples to CSV/JSON and clear history if authenticated.",
  "frontend/src/features/history/mutations.ts": "Defines React Query mutations for saving connectivity measurements and clearing stored network history.",
  "frontend/src/features/history/networkHistoryMapper.ts": "Maps measurements to backend NetworkCheckResult objects and converts them back to frontend measurements.",
  "frontend/src/features/history/queries.ts": "Fetches stored network history from the backend when the user is authenticated.",
  "frontend/src/features/monitoring/connectivityCheck.ts": "Performs a connectivity check via a lightweight HEAD request and returns latency or detailed error info.",
  "frontend/src/features/monitoring/metrics.ts": "Computes latency averages, jitter, success rate, and derives a stability classification from samples.",
  "frontend/src/features/monitoring/types.ts": "Defines types for connectivity measurements, derived metrics, and stability status.",
  "frontend/src/features/monitoring/useConnectivityMonitor.ts": "Continuously performs connectivity checks, maintains sample history, computes metrics, handles retries, and optionally saves results.",
  "frontend/src/features/profile/ProfileSetupModal.tsx": "Displays a modal prompting new authenticated users to enter and save their name, using profile query and mutation hooks.",
  "frontend/src/features/profile/queries.ts": "Defines React Query hooks to fetch and save the caller's user profile through the backend actor.",
  "frontend/src/features/settings/settingsStorage.ts": "Loads, validates, updates, and persists stabilization settings in localStorage via a custom hook.",
  "frontend/src/features/settings/settingsTypes.ts": "Declares the StabilizationSettings interface, default values, and allowable bounds.",
  "frontend/src/features/settings/SettingsView.tsx": "UI for editing stabilization settings such as interval, timeout, and retry configuration.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and updates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, and identity loading.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light and dark theme color tokens.",
  "frontend/src/main.tsx": "Initializes the app root with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON metadata describing project state, features, and required images for a network stabilizer application."
}